### 9.01

What will Scheme print? Figure it out yourself before you try it on the computer.

***

~~~ scheme
> (lambda (x) (+ (* x 3) 4))
#<procedure>
~~~

An unnamed procedure is returned; it is not invoked.

***

~~~ scheme
> ((lambda (x) (+ (* x 3) 4)) 10)
34
~~~

The unnamed procedure above is invoked with the argument `10`.

***

~~~ scheme
> (every (lambda (wd) (word (last wd) (bl wd)))
         '(any time at all))
(yan etim ta lal)
~~~

An unnamed procedure that takes the last letter of a word and puts it at the beginning is applied to every word of the sentence supplied as its argument.

***

~~~ scheme
> ((lambda (x) (+ x 3)) 10 15)
~~~

Ths will return an error; the procedure expects a single argument but is supplied with two.