### 6.11

Write a predicate `valid-date?` that takes three numbers as arguments, representing a month, a day of the month, and a year. Your procedure should return `#t` if the numbers represent a valid date (e.g. it isnâ€™t the 31st of September). February has 29 days if the year is divisible by 4, except that if the year is divisible by 100 it must also be divisible by 400.

~~~ scheme
> (valid-date? 10 4 1979)
#t

> (valid-date? 20 4 1776)
#f

> (valid-date? 5 0 1992)
#f

> (valid-date? 2 29 1900)
#f

> (valid-date? 2 29 2000)
#t
~~~

***

~~~ scheme
(define (valid-date? mm dd yyyy)
  (and (valid-year? yyyy) (valid-month? mm) (valid-day-of-month? dd mm yyyy)))

(define (valid-year? yyyy)
  (>= yyyy 0))

(define (valid-month? mm)
  (and (>= mm 1) (<= mm 12)))

(define (valid-day-of-month? dd mm yyyy)
  (and (> dd 0)
       (or (and (>= dd 1) (<= dd 28))
           (and (<= dd 31) (member? mm '(1 3 5 7 8 10 12)))
           (and (<= dd 30) (member? mm '(4 6 9 11)))
           (and (= dd 29) (leap-year? yyyy)))))

(define (leap-year? yyyy)
  (if (= 0 (remainder yyyy 100))
      (if (= 0 (remainder yyyy 400))
          #t
          #f)
      (if (= 0 (remainder yyyy 4))
          #t
          #f)))     
~~~